src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
</mdclass:Catalog>

src/Enums/Пол/Пол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Пол</name>
  <enumValues>
    <name>Мужской</name>
  </enumValues>
  <enumValues>
    <name>Женский</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ОбновитьФИО();
	ПроверкаПола();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении(Элемент)
	ОбновитьФИО();
КонецПроцедуры
&НаКлиенте
Процедура ПроверкаПола()
	Если Объект.Отчество = "" Тогда
	Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.ПустаяСсылка");
	КонецЕсли;
	
	Если Прав(Объект.Отчество, 2) = "ич" ИЛИ Прав(Объект.Отчество, 4) = "евич" ИЛИ Прав(Объект.Отчество,4) = "ович" Тогда
	Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.Мужской");
	Иначе Объект.Пол = ПредопределенноеЗначение("Перечисление.Пол.Женский");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте 
Процедура ОбновитьФИО()
	Объект.Наименование= Объект.ФИО+ " "+ Объект.Имя+ " " +Объект.Отчество;
КонецПроцедуры
